/*Створити функцію getMaxDigit(number) – яка отримує будь-яке число та виводить 
найбільшу цифру в цьому числі. Приклади: 1236 -> 6, 987 -> 9, 385 -> 8*/

/*Створити функцію, яка визначає ступінь числа. 
Не використовуючи Math.pow та **. Використовуйте цикл*/

/*Створити функцію, яка форматує ім'я, роблячи першу букву великою. 
("влад" -> "Влад", "вЛАД" -> "Влад" і так далі);*/

/*Створити функцію, яка вираховує суму, що залишається 
після оплати податку від зарабітньої плати. 
(Податок = 18% + 1.5% -> 19.5%). Приклад: 1000 -> 805*/

/*Створити функцію, яка повертає випадкове ціле число 
в діапазоні від N до M. Приклад: getRandomNumber(1, 10) -> 5*/

/*Створити функцію, яка рахує скільки разів певна буква 
повторюється в слові. Приклад: countLetter("а", "Асталавіста") -> 4*/

/*Створіть функцію, яка конвертує долари в гривні та навпаки в 
залежності від наявності символа $ або UAH в рядку. Приклад: 
convertCurrency("100$") -> 2500 грн. або convertCurrency("2500UAH") -> 100$*/

/*Врахуйте, інші валюти не конвертуються, потрібно виводити 
помилку, і також регістр uah не має значення.*/

/*Створіть функцію генерації випадкового паролю (тільки числа), 
довжина встановлюється користувачем або по замовчуванню = 8 символам.
Приклад: getRandomPassword(4) -> 1875, getRandomPassword() -> 87240124*/

/*Створіть функцію, яка видаляє всі букви з речення. 
Приклад: deleteLetters('a', "blablabla") -> "blblbl"*/

/*Створіть функцію, яка перевіряє, чи є слово паліндромом. 
Приклад: isPalyndrom("мадам") -> true, isPalyndrom("кокос") -> 
false, isPalyndrom("Аргентина манит негра") -> true*/

/*Створіть функцію, яка видалить з речення букви, які зустрічаються
більше 1 разу. Приклад: deleteDuplicateLetter("Бисквит был очень нежный") -> "сквтлчьжй"*/